Repository: erikvb/Apollo.MLLanguageSelector
Catalog: Apollo.MLLanguageSelector/trunk/App_LocalResources/Settings.ascx.*.resx
Languages: nl_nl

# ControlTitle_settings.Text
source: MLLanguageSelector Settings
nl_nl: Instellingen voor MLLanguageSelector

# plOnlyLanguageCode.Text
source: Use only language code:
nl_nl: Gebruik alleen taalcode:

# plOnlyLanguageCode.Help
source: When checked, the language selector will pass only a language to the server (eg. "en" instead of "en-US")
nl_nl: Als deze optie is aangevinkt, dan geeft de taalselector alleen taalcode door aan de server (bv. "nl" in plaats van "nl-NL")

# plForceHidden.Text
source: Hide selector:
nl_nl: Verberg selector:

# plForceHidden.Help
source: When checked, none of the available languages will be rendered.<br><b>Tip</b> You can use this option in combination with map languages to redirect requests for one language to another.
nl_nl: Als deze optie is aangevinkt, dan zullen géén van de beschikbare talen worden weergegeven.<br><b>Tip</b> Deze optie kan gebruikt worden in combinatie met de functie om talen automatisch te vervangen.

# plMapLanguages.Text
source: Map languages
nl_nl: Vervang talen

# plMapLanguages.Help
source: You can map one or more languages to one or more other languages. This can be useful if you have a language available in your portal that you don't want your visitors to view pages in. Syntax: [source locale]:[destination locale], eg. de-DE:en-US. You can separate multiple mappings by a semicolon (;).See help text for more information.
nl_nl: U kunt één of meerdere talen door één of meerdere andere talen vervangen. Deze functie kan gebruikt worden als u een taal beschikbaar in uw portal heeft waarvan u niet wilt dat bezoekers pagina's in deze taal kunnen zien. Syntax: [bron locale]:[doel locale], bv. de-DE:en-US. Meerdere vervangingen moeten door een puntkomma (;) gescheiden worden. Zie help tekst voor meer informatie.

# None.Text
source: None
nl_nl: Verborgen

# Left.Text
source: Left
nl_nl: Links

# Right.Text
source: Right
nl_nl: Rechts

# plMenuFlagPosition.Text
source: Position of active language flag:
nl_nl: Plaats voor vlag actieve taal:

# plMenuFlagPosition.Help
source: Use this option to select whether and were a flag depicting the active language should be displayed.<br><b>NB</b> This flag will only be displayed when the drop down menu is visible.
nl_nl: Gebruik deze optie om aan te geven óf en waar de flag behorende bij de huidige taal getoond moet worden.<br><b>NB</b> Deze vlag zal alleen zichtbaar zijn als het menu zichtbaar is.

# plGenerateType.Text
source: Generate for:
nl_nl: Genereer voor:

# plGenerateType.Help
source: Here you can generate the necessary attributes for the MLLanguageSelector skinobject. You can generate for use in .ascx file, or for use in skin.xml file. The options as set above will be used.
nl_nl: Hier kunt u de benodigde attributen genereren voor gebruik met het MLLanguageSelector skinobject. U kunt genereren voor gebruik in een .ascx bestand, of voor gebruik in een skin.xml bestand. De options zoals hierboven ingesteld zullen worden gebruikt.

# btnGenerateNow.Text
source: Generate Now
nl_nl: Genereer nu

# valMapLanguages.Error
source: <br>Syntax is not correct. Either u used a non existent language code, wrong punctiation or a circular reference
nl_nl: <br>Syntax is niet correct. U heeft óf een niet bestaande taalcode gebruikt, óf verkeerde interpunctie toegepast (alleen ":" en ";" zijn toegestaan), óf er is sprake van een circulaire referentie.

# ResourceName.Text
source: Name from Resourcefile
nl_nl: Naam uit resourcebestand

# plMapDomains.Text
source: Map Domains
nl_nl: Koppel taal aan domeinnaam

# valMapDomains.Error
source: <br>Syntax is not correct. Either u used a non domain (domains must be part of the http aliases of this portal), a childportal alias (domain includes a "/") or wrong punctuation
nl_nl: <br>Syntax is niet correct. U heeft een domeinnaam gebruikt die niet in gebruik is als http alias voor dit portal, óf u heeft een sub portal alias (die een "/" bevat), óf de punctuatie klopt niet.

# plMapDomains.Help
source: You can map one or more domains to one or more different languages. The languageselector will add the proper querystring variable to the url to ensure a proper language. Only domains that are listed in the portal's http alias list can be used, and only fully quallified domain names. Child portal http aliases are not supported.
nl_nl: U kunt één of meerdere domeinnamen koppelen aan een taal. De taalselector zal de juiste taal parameter aan de URL toevoegen, zodat de pagina in de juiste taal weergegeven wordt. Alleen domeinnamen die voorkomen in de lijst met httpaliassen van dit portal kunnen worden gebruikt, sub portaal aliassen kunnen echter niet worden gebruikt.

# FlagType.Text
source: Flag Type
nl_nl: Vlag type

# plFlagType.Help
source: Select the flagtype you want to display. This will not used if an alternate flag location is used
nl_nl: Selecteer het type vlag.

# plFlagType.Text
source: Flagtype
nl_nl: Vlag type
