Repository: erikvb/Apollo.MLLanguageSelector
Catalog: Apollo.MLLanguageSelector/trunk/App_LocalResources/Settings.ascx.*.resx
Languages: nl_nl

# Horizontal.Text
source: Horizontal
nl_nl: Horizontaal

# Vertical.Text
source: Vertical
nl_nl: Verticaal

# plDisplayType.Text
source: Display type:
nl_nl: Weergave type:

# plDisplayType.Help
source: The display type controls the displayed name of languages. See help for more info
nl_nl: Hiermee bepaalt u hoe de naam van een taal wordt weergegeven. Zie help voor meer informatie.

# plSeparator.Text
source: Seperator:
nl_nl: Scheidingsteken(s):

# plSeparator.Help
source: This is the text to seperate flags or hyperlinks
nl_nl: Dit is de tekst die gebruikt wordt om de vlaggen of hyperlinks van elkaar te scheiden

# plCssClass.Text
source: Css Class Name
nl_nl: Css klasse

# plCssClass.Help
source: The CSS class name used to format the menu and the hyperlinks
nl_nl: De css klasse die gebruikt wordt voor de weergave van het menu en de hyperlinks.

# plHideCurrent.Text
source: Hide Current:
nl_nl: Verberg huidige:

# plHideCurrent.Help
source: In flags and hyperlink view hide the current language
nl_nl: Verberg de huidige taal in de vlaggen/hyperlink weergave

# plAlignment.Text
source: Alignment:
nl_nl: Uitlijning:

# plAlignment.Help
source: Controls the flow of flags and hyperlinks
nl_nl: Hiermee bepaalt u of de vlaggen/hyperlinks naast elkaar of onder elkaar weergeven moeten worden.

# plHyperlinks.Text
source: Show Hyperlinks:
nl_nl: Toon hyperlinks:

# plHyperlinks.Help
source: Show language hyperlinks
nl_nl: Geef hyperlinks voor talen weer.

# plFlags.Help
source: Show flag hyperlinks
nl_nl: Toon vlag hyperlinks

# plFlags.Text
source: Show flags:
nl_nl: Toon vlaggen:

# plMenu.Text
source: Show Drop Down Menu:
nl_nl: Toon menu:

# plMenu.Help
source: Show drop down menu
nl_nl: Toon een menu met alle beschikbare talen

# plDisplayLabel.Text
source: Show Label:
nl_nl: Toon label:

# plDisplayLabel.Help
source: Show Label.
nl_nl: Geef een label weer vóór het menu.

# plLabelCssClass.Text
source: Label CSS Class:
nl_nl: Label CSS klasse:

# plLabelCssClass.Help
source: The CSS class name used to format the label
nl_nl: Css klasse die gebruikt wordt voor de opmaak van het label.

# DisplayName.Text
source: Display Name
nl_nl: Weergavenaam

# EnglishName.Text
source: English Name
nl_nl: Engelse naam

# Lcid.Text
source: Locale Identifier
nl_nl: Locale identificatienr.

# Name.Text
source: Name
nl_nl: Naam

# NativeName.Text
source: Native Name
nl_nl: Vertaalde taal/regio naam

# TwoLetterIsoCode.Text
source: Two Letter Iso Code
nl_nl: Tweeletterige ISOcode

# ThreeLetterIsoCode.Text
source: Three Letter Iso Code
nl_nl: Drieletterige ISOcode

# NativeLanguageName.Text
source: Native Language Name
nl_nl: Vertaalde naam van taal

# EnglishLanguageName.Text
source: English Language Name
nl_nl: Engelse naam van taal
